from messenger_bot_api import MessageBotEvent

def ekp_text(event: MessageBotEvent):
    """Информация о ЕКП"""
    context = (
        'Единый календарный план физкультурных, спортивных и массовых спортивно-зрелищных мероприятий города Москвы'
    )
    context_rd = (
        '\n\nРаспоряжение Москомспорта от 3 марта 2022 г. № 50 «Об установлении порядка разработки и утверждения Единого календарного плана физкультурных, спортивных и массовых спортивно-зрелищных мероприятий города Москвы».'
    )
    event.reply_text(context+context_rd)


def ias_text(event: MessageBotEvent):
    """Информация об ИАС"""
    context = (
        'Автоматизированная информационная система «Информационно-аналитическая система спортивной отрасли города Москвы» (далее – ИАС Спорт)'
        '\n\nПостановление Правительства Москвы от 22 апреля 2014 г. \n№ 203-ПП «Об автоматизированной информационной системе «Информационно-аналитическая системе спортивной отрасли города Москвы»'
        '\nАдрес системы: [url=https://iasnew.sport.mos.ru]iasnew.sport.mos.ru[/url]'
    )
    event.reply_text(context)


def minsport_text(event: MessageBotEvent):
    """Информация об Минспорте"""
    context = (
        'Министерство спорта Российской Федерации (Минспорт России) является федеральным органом исполнительной власти, осуществляющим функции'
        'по выработке и реализации государственной политики и нормативно-правовому регулированию в сфере физической культуры и спорта, '
        'а также по оказанию государственных услуг (включая предотвращение допинга в спорте и борьбу с ним) и управлению государственным имуществом '
        'в сфере физической культуры и спорта. [url]https://minsport.gov.ru/ministry/[/url]\n\n'
    )
    context_gis = (
        'ФГИС «Спорт» - Информационная платформа позволяет собирать и агрегировать данные сферы ФКиС для обеспечения прозрачности процессов, '
        'реализуемых в ходе достижений целей государственной политики в сфере физической культуры и спорта '
        '[url]https://sport.gov.ru/fcis/lk[/url] \n\n'
    )
    context_emmir = (
        'ЕМИР -  это Единый методический информационный ресурс в области физической культуры, спорта и спортивной медицины, официальный '
        'интернет-портал Министерства спорта Российской Федерации'
        '\n[url]https://emir.gov.ru/analytics/indicators[/url]'
    )
    event.reply_text(context+context_gis+context_emmir)



