col_drop = ['Вид спорта', 'Общая численность',
                     'НП1', 'НП2', 'НП3', 'НП4', 'НП', 'НП пк',
                     'ТЭ1', 'ТЭ2','ТЭ3', 'ТЭ4', 'ТЭ5', 'ТЭ', 'ТЭ пк', 
                     'СС1', 'СС2', 'СС3', 'СС', 'СС пк', 
                     'ВСМ', 'ВСМ пк', 
                     'Гос работа']

col_gos = ['Учреждение', 'Вид спорта', 'Общая численность',
                         'НП1', 'НП2', 'НП3', 'НП4', 'НП', 'НП пк',
                         'ТЭ1', 'ТЭ2','ТЭ3', 'ТЭ4', 'ТЭ5', 'ТЭ', 'ТЭ пк', 
                         'СС1', 'СС2', 'СС3', 'СС', 'СС пк', 
                         'ВСМ', 'ВСМ пк', 
                         'Гос работа']

col_bd = ('id_firm', 'id_sport', 'total_sport',
            'np1', 'np2', 'np3', 'np4', 'np', 'np_pk',
            'te1', 'te2', 'te3', 'te4', 'te5', 'te', 'te_pk',
            'cc1', 'cc2', 'cc3', 'cc', 'cc_pk', 
            'vcm', 'vcm_pk',
            'gos_work', 
            'name_file')