from config import bot

def process_text(message):
    context = """
    Министерство спорта Российской Федерации (Минспорт России) является федеральным органом исполнительной власти, осуществляющим функции
     по выработке и реализации государственной политики и нормативно-правовому регулированию в сфере физической культуры и спорта, 
     а также по оказанию государственных услуг (включая предотвращение допинга в спорте и борьбу с ним) и управлению государственным имуществом 
     в сфере физической культуры и спорта. https://minsport.gov.ru/ministry/ \n\n
    """
    context_gis = """
    ФГИС «Спорт» - Информационная платформа позволяет собирать и агрегировать данные сферы ФКиС для обеспечения прозрачности процессов, 
    реализуемых в ходе достижений целей государственной политики в сфере физической культуры и спорта
    https://sport.gov.ru/fcis/lk \n\n
    """
    context_emmir = """
    ЕМИР -  это Единый методический информационный ресурс в области физической культуры, спорта и спортивной медицины, официальный 
    интернет-портал Министерства спорта Российской Федерации
    https://emir.gov.ru/analytics/indicators
    """
    bot.send_message(message.chat.id, text=context+context_rd)
    return

